app/views/temas/show.html.erb

          </div>
          <% if(@tema.archivo_adjunto_temas.size>0) %>
---
SELECT COUNT(*) FROM "archivo_adjunto_temas" WHERE "archivo_adjunto_temas"."tema_id" = ?  [["tema_id", 1]]

	</div>
  <%if (comentario.adjunto_tema_comentarios.size>0)%>
---
SELECT "tema_comentarios".* FROM "tema_comentarios" WHERE "tema_comentarios"."tema_id" = ?  [["tema_id", 1]]
SELECT COUNT(*) FROM "tema_comentarios" WHERE "tema_comentarios"."tema_id" = ?  [["tema_id", 1]]