app/views/temas/show.html.erb

          <% @tema.grupos_pertenece.each do |grupo| %>
            <%= Grupo.find(grupo).nombre %><br/>
---
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]