app/views/eventos/_form.html.erb

            <%= check_box_tag "grupos[]", 1 , checked = true , :id => "checkPublico"%><br/>
            <% current_user.grupos.each do |grupo| %>
---
SELECT "grupos".* FROM "grupos"