app/views/usuarios/show.html.erb

SELECT "subscripcions".* FROM "subscripcions" WHERE "subscripcions"."usuario_id" = ?  [["usuario_id", 2]]
SELECT COUNT(*) FROM "subscripcions" WHERE "subscripcions"."usuario_id" = ?  [["usuario_id", 2]]
---
                    <button class="btn btn-primary" data-toggle="modal" data-target="#mis_suscripciones">
                    Mis Suscripciones (<%= @usuario.subscripcions.count %>)

SELECT "temas".* FROM "temas" WHERE "temas"."usuario_id" = ?  [["usuario_id", 2]]
SELECT COUNT(*) FROM "temas" WHERE "temas"."usuario_id" = ?  [["usuario_id", 2]]
---
                    <button class="btn btn-primary" data-toggle="modal" data-target="#mis_temas">
                    Mis Temas (<%= @usuario.temas.count %>)

SELECT "eventos".* FROM "eventos" WHERE "eventos"."usuario_id" = ?  [["usuario_id", 2]]
SELECT COUNT(*) FROM "eventos" WHERE "eventos"."usuario_id" = ?  [["usuario_id", 2]]
---
                    <button class="btn btn-primary" data-toggle="modal" data-target="#mis_eventos">
                    Mis Eventos (<%= @usuario.eventos.count %>)

SELECT "cuestionarios".* FROM "cuestionarios" WHERE "cuestionarios"."usuario_id" = ?  [["usuario_id", 2]]
SELECT COUNT(*) FROM "cuestionarios" WHERE "cuestionarios"."usuario_id" = ?  [["usuario_id", 2]]
---
                        <button class="btn btn-primary" data-toggle="modal" data-target="#mis_cuestionarios">
                        Mis Cuestionarios (<%= @usuario.cuestionarios.count %>)