app/controllers/cuestionarios_controller.rb

	def nuevo_cuestionario
		@cuestionario = Cuestionario.new
		@grupo = Grupo.find(params[:id])
		@cuestionarios = Array.new
    current_user.grupos.each do |grupo|
      grupo.cuestionarios.each do |cuestio|
---
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
SELECT "cuestionarios".* FROM "cuestionarios" WHERE (grupo_id = 1)