app/controllers/eventos_controller.rb

  def index
     @eventos = Array.new
   if params[:grupo] != nil && Grupo.find(params[:grupo]).habilitado
        @grupo = Grupo.find(params[:grupo])
      else
        @grupo = Grupo.find(1)
      end
       @grupo.eventos.each do |evento|
---
SELECT "eventos".* FROM "eventos"

  def show
   @evento = Evento.find(params[:id])
---
SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @evento = Evento.new(evento_params)
    @evento.usuario_id = current_user.id

    if params[:grupos] != nil && @evento.save
        params[:grupos].each do |grupo|
          grupi = Grupo.find(grupo)
          grupi.eventos << @evento
          @evento.grupos_pertenece << grupo
           grupi.save
            if current_user.rol == "Docente" || !Grupo.find(grupo).moderacion
---
INSERT INTO "eventos" ("created_at", "detalle", "estado", "grupo_id", "lugar", "nombre", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @evento.destroy
---
DELETE FROM "eventos" WHERE "eventos"."id" = ?  [["id", 1]]

    def set_evento
      @evento = Evento.find(params[:id])
---
SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", "1"]]