app/controllers/grupos_controller.rb

SELECT "grupos".* FROM "grupos" WHERE "grupos"."habilitado" = 't' LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "grupos" WHERE "grupos"."habilitado" = 't'
---
  def index
    @grupos = Grupo.all_habilitados.page(params[:page]).per(5)

SELECT "grupos".* FROM "grupos"
---
  def buscar
    @grupos=Array.new
    aux = Grupo.all_habilitados
    nombre = params[:nombre]
    if nombre != "" && nombre != nil
      aux.each do |grupo|

SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
     @grupo = Grupo.find(params[:id])

SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
---
  def edit
    @grupo = Grupo.find(params[:id])

INSERT INTO "grupos" ("created_at", "descripcion", "estado", "llave", "nombre", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "subscripcions" ("created_at", "grupo_id", "updated_at", "usuario_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 22 Aug 2014 07:19:09 BOT -04:00], ["grupo_id", 2], ["updated_at", Fri, 22 Aug 2014 07:19:09 BOT -04:00], ["usuario_id", 1]]
---
  def create
    @grupo = Grupo.new(grupo_params)
    @grupo.usuario_id = current_user.id
    @grupo.verificar_grupo
    respond_to do |format|
      if @grupo.save
        subs = Subscripcion.new
        subs.grupo = @grupo
        subs.usuario = current_user
        subs.save

SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
---
  def suscriptores
    @grupo = Grupo.find(params[:id])

SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
---
  def invitacion_grupo
    @grupo = Grupo.find(params[:id])