app/controllers/sessions_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    usuario=Usuario.find(session[:usuario_id])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "usuarios" SET "conectado" = ?, "updated_at" = ? WHERE "usuarios"."id" = 1  [["conectado", true], ["updated_at", Wed, 15 Oct 2014 00:14:24 BOT -04:00]]
---
  def obtener_conectados
    usuario=Usuario.find(params[:usuario_id])
    usuario.conectado=true
    usuario.save

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "usuarios" SET "conectado" = ?, "updated_at" = ? WHERE "usuarios"."id" = 1  [["conectado", false], ["updated_at", Wed, 15 Oct 2014 00:14:26 BOT -04:00]]
---
  def eliminar_conectado
    usuario=Usuario.find(params[:usuario_id])
    usuario.conectado=false
    usuario.save