app/controllers/suscripcion_temas_controller.rb

SELECT "suscripcion_temas".* FROM "suscripcion_temas" WHERE "suscripcion_temas"."usuario_id" = 1 AND "suscripcion_temas"."tema_id" = 1
DELETE FROM "suscripcion_temas" WHERE "suscripcion_temas"."id" = ?  [["id", 1]]
---
  def delete
        @suscripcion = SuscripcionTema.where(usuario_id: current_user.id,tema_id: params[:id])
        if @suscripcion!=nil
          @suscripcion.destroy_all