app/controllers/tareas_controller.rb

	def index
		@grupo = Grupo.find(params[:grupo])
		if(@grupo.habilitado && params[:grupo]!="1" && current_user.esta_subscrito?((params[:grupo])))
		@tareas = Tarea.where(:grupo_id => params[:grupo]).order("updated_at DESC").page(params[:page]).per(5)
---
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
SELECT "tareas".* FROM "tareas" WHERE "tareas"."grupo_id" = 3 ORDER BY updated_at DESC

	def responder_tarea
		@responder_tarea = ResponderTarea.new
		@tarea = Tarea.buscar_tarea(params[:id])
		if(!@tarea.nil?)
		@grupo = @tarea.grupo
		@id=@grupo.id
		@suscrito = Subscripcion.where(:grupo_id => @grupo.id, :usuario_id => current_user.id)
		if((@tarea.usuario_id!=current_user.id) && !@suscrito.first.nil? && !ResponderTarea.ya_envio_tarea(current_user.id,@tarea.id) )
---
SELECT "subscripcions".* FROM "subscripcions" WHERE "subscripcions"."grupo_id" = 3 AND "subscripcions"."usuario_id" = 1 ORDER BY "subscripcions"."id" ASC LIMIT 1
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 3]]
SELECT "responder_tareas".* FROM "responder_tareas" WHERE "responder_tareas"."usuario_id" = 1 AND "responder_tareas"."tarea_id" = 1 ORDER BY "responder_tareas"."id" ASC LIMIT 1
SELECT "subscripcions".* FROM "subscripcions" WHERE "subscripcions"."usuario_id" = ?  [["usuario_id", 1]]
SELECT "tareas".* FROM "tareas" WHERE "tareas"."id" = ? LIMIT 1  [["id", "1"]]

	def responder_tarea_crear
		@responder_tarea = ResponderTarea.new(tarea_respuesta_params)
		@tarea = Tarea.find(params[:id])
		@responder_tarea.tarea_id = @tarea.id
		@responder_tarea.usuario_id = current_user.id
		if(@responder_tarea.save)
		add_attached_files_respuesta(@responder_tarea.id)
		flash[:alert] = 'Tarea enviada Exitosamente!'
		redirect_to '/grupos/'+@tarea.grupo.id.to_s+'/tareas'
		else
		@grupos = Array.new
		if(current_user!=nil)
		current_user.subscripcions.each do |subs|
		@grupos.push(subs.grupo)
		end
		@grupo = Grupo.find(@tarea.grupo.id.to_s)
---
SELECT "tareas".* FROM "tareas" WHERE "tareas"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "responder_tareas" ("created_at", "descripcion", "tarea_id", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 22 Aug 2014 07:19:15 BOT -04:00], ["descripcion", "Descripcion de prueba"], ["tarea_id", 1], ["updated_at", Fri, 22 Aug 2014 07:19:15 BOT -04:00], ["usuario_id", 1]]
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 3]]
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]

	def new
		if(params[:id]!="1" && Grupo.find(params[:id]).usuario==current_user)
---
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 1]]

	def eliminar
		@tarea = Tarea.find(params[:id])
		@grupo = @tarea.grupo
		if(@tarea.usuario_id == current_user.id)
		@tarea.destroy
---
SELECT "tareas".* FROM "tareas" WHERE "tareas"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "tareas" WHERE "tareas"."id" = ?  [["id", 1]]

	def show
		@tarea = Tarea.find(params[:id])
		if(@tarea.tarea_base!=nil)
		@tarea_base = Tarea.find(@tarea.tarea_base)
		end
		@todos_los_comentarios = @tarea.tarea_comentarios.reverse
		if(current_user == @tarea.usuario)
		@tareas_enviadas = ResponderTarea.where(:tarea_id => @tarea.id)
---
SELECT "tareas".* FROM "tareas" WHERE "tareas"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "responder_tareas".* FROM "responder_tareas" WHERE "responder_tareas"."usuario_id" = 1 AND "responder_tareas"."tarea_id" = 1 ORDER BY "responder_tareas"."id" ASC LIMIT 1
SELECT "tarea_comentarios".* FROM "tarea_comentarios" WHERE "tarea_comentarios"."tarea_id" = ?  [["tarea_id", 1]]

	def create
		@tarea = Tarea.new(tarea_params)
		@tarea.grupo_id=params[:tarea][:grupo_id]
		@tarea.usuario_id = current_user.id
		if(@tarea.save)
		add_attached_files(@tarea.id)
		flash[:alert] = 'Tarea creada Exitosamente!'
		notificar_por_email(@tarea.grupo_id, @tarea)
		notificacion_push(@tarea.grupo_id, @tarea)
		redirect_to '/grupos/'+params[:tarea][:grupo_id]+'/tareas'
		else
		@grupos = Array.new
		if(current_user!=nil)
		current_user.subscripcions.each do |subs|
---
INSERT INTO "tareas" ("created_at", "descripcion", "fecha_entrega", "grupo_id", "hora_entrega", "titulo", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "subscripcions".* FROM "subscripcions"