app/controllers/tareas_controller.rb

SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 3]]
---
	def eliminar
		@tarea = Tarea.find(params[:id])
		@tarea.grupos.each do |grupo|

SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 3]]
---
	def show
		control = false
		if !Tarea.where(:id => params[:id]).empty?
		@tarea = Tarea.find(params[:id])

		@tarea.grupos.each do |grupo|

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
---
	def create
		@tarea = Tarea.new(tarea_params)
		@tarea.usuario_id = current_user.id

		if current_user.rol == "Docente"
			@tarea.admitido = true
		else
			@tarea.admitido = false
		end

		if params[:grupos] != nil &&  @tarea.save
			params[:grupos].each do |grupo|
				Grupo.find(grupo).tareas << @tarea