app/controllers/temas_controller.rb

  def index
     @temas = Array.new
   if params[:id] != nil && Grupo.find(params[:id]).habilitado
        @grupo = Grupo.find(params[:id])
      else
        @grupo = Grupo.find(1)
      end
       @grupo.temas.each do |tema|
---
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
SELECT "temas".* FROM "temas" WHERE "temas"."grupo_id" = ?  [["grupo_id", 1]]

  def buscar
    @temas = Array.new
    @grupo = Grupo.find(params[:grupo])
    aux = Tema.where(:grupo_id=>params[:grupo])
---
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
SELECT "temas".* FROM "temas" WHERE (cuerpo LIKE '%primera%')

  def new
    @tema = Tema.new
    @grupos = Array.new
    if(current_user!=nil)
      current_user.subscripcions.each do |subs|
        @grupos.push(subs.grupo)
      end
      @grupo = Grupo.find(params[:id])
---
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]

  def show
    if Tema.exists?(:id => params[:id])
    @tema = Tema.find(params[:id])
    @tema.grupos.each do |grupo|
      if current_user.esta_subscrito?(grupo.id)
        @grupo = grupo
        break
      end
    end
     #notificaciones.each do |notificacion|
      #if ( TemaComentario.find(notificacion.tema_comentario_id).tema_id == @tema.id )
       # notificacion.notificado = true
        #notificacion.save
      #end
    #end
      @comentarios= Kaminari.paginate_array(@tema.tema_comentarios).page(params[:page]).per(10)
---
SELECT "temas".* FROM "temas" WHERE "temas"."id" = ? ORDER BY "temas"."id" ASC LIMIT 1  [["id", 1]]
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
SELECT "tema_comentarios".* FROM "tema_comentarios" WHERE "tema_comentarios"."tema_id" = ?  [["tema_id", 1]]
SELECT COUNT(*) FROM "adjunto_tema_comentarios" WHERE "adjunto_tema_comentarios"."tema_comentario_id" = ?  [["tema_comentario_id", 1]]
SELECT COUNT(*) FROM "tema_comentarios" WHERE "tema_comentarios"."tema_id" = ?  [["tema_id", 1]]

  def create
    @tema = Tema.new(tema_params)
    @tema.usuario_id = current_user.id

    if params[:grupos] != nil && @tema.save
      params[:grupos].each do |grupo|
        grupi = Grupo.find(grupo)
        grupi.temas << @tema
        @tema.grupos_pertenece << grupo
        grupi.save
if current_user.rol == "Docente" || !Grupo.find(grupo).moderacion          @tema.grupos_dirigidos << grupo
        end
      end

      @tema.save
      add_attached_files(@tema.id)

      @suscripcion=SuscripcionTema.new
      @suscripcion.usuario_id=current_user.id
      @suscripcion.tema_id=@tema.id
      @suscripcion.save
---
INSERT INTO "temas" ("created_at", "cuerpo", "grupo_id", "titulo", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?)
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "suscripcion_temas" ("created_at", "tema_id", "updated_at", "usuario_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 22 Aug 2014 07:19:00 BOT -04:00], ["tema_id", 1], ["updated_at", Fri, 22 Aug 2014 07:19:00 BOT -04:00], ["usuario_id", 1]]

  def update
    @tema = Tema.find(params[:id])
    if(@tema.update(params[:tema].permit(:titulo,:cuerpo)))
---
SELECT "temas".* FROM "temas" WHERE "temas"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "temas" SET "titulo" = ?, "cuerpo" = ?, "updated_at" = ? WHERE "temas"."id" = 1  [["titulo", "Titulo nuevo"], ["cuerpo", "Cuerpo nuevo"], ["updated_at", Fri, 22 Aug 2014 07:18:58 BOT -04:00]]

  def visible
    @tema = Tema.find(params[:id])
    grupo = params[:id_grupo]
    if(@tema.usuario_id == current_user.id)
      @tema.destroy
---
SELECT "temas".* FROM "temas" WHERE "temas"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "temas" WHERE "temas"."id" = ?  [["id", 1]]

  def show_mine
    todos_temas = Tema.all
---
SELECT "temas".* FROM "temas"