app/controllers/temas_controller.rb

  def index
    @temas = @grupo.temas.order("updated_at DESC").page(params[:page]).per(5)
---
SELECT "temas".* FROM "temas" WHERE "temas"."grupo_id" = ? ORDER BY updated_at DESC LIMIT 5 OFFSET 0  [["grupo_id", 1]]
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "temas" WHERE "temas"."grupo_id" = ? LIMIT 5 OFFSET 0) subquery_for_count  [["grupo_id", 1]]