app/controllers/temas_y_tareas_controller.rb

SELECT "tareas".* FROM "tareas" WHERE "tareas"."grupo_id" = ?  [["grupo_id", 3]]
SELECT "temas".* FROM "temas" WHERE "temas"."grupo_id" = ? AND (visible = 1)  [["grupo_id", 3]]
---
  def index

    if( params[:id] != nil && Grupo.find(params[:id]).habilitado)
       @grupo = Grupo.find(params[:id])
     else
       @grupo = Grupo.find(1)
       redirect_to temas_path
    end
    if(params[:id]=="1")
      redirect_to temas_path
    else
      @temas_y_tareas = @grupo.temas.where("visible = ?", 1)+@grupo.tareas