app/controllers/temas_y_tareas_controller.rb

  def index

    if( params[:id] != nil && Grupo.find(params[:id]).habilitado)
       @grupo = Grupo.find(params[:id])
    else
       @grupo = Grupo.find(1)
       redirect_to temas_path
    end
    if(params[:id]=="1")
      redirect_to temas_path
    else
      @temas = @grupo.temas.order("updated_at DESC").page(params[:page]).per(3)
      @tareas = Tarea.where(:grupo_id => params[:id]).order("updated_at DESC").page(params[:page]).per(3)
---
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = ? ORDER BY "grupos"."id" ASC LIMIT 1  [["id", 1]]
SELECT "temas".* FROM "temas" WHERE "temas"."grupo_id" = ? ORDER BY updated_at DESC LIMIT 3 OFFSET 0  [["grupo_id", 3]]
SELECT COUNT(*) FROM "temas" WHERE "temas"."grupo_id" = ?  [["grupo_id", 3]]
SELECT "tareas".* FROM "tareas" WHERE "tareas"."grupo_id" = 3 ORDER BY updated_at DESC LIMIT 3 OFFSET 0