app/controllers/tema_comentarios_controller.rb

SELECT "temas".* FROM "temas" WHERE "temas"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "tema_comentarios" ("created_at", "cuerpo", "tema_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 22 Aug 2014 07:18:57 BOT -04:00], ["cuerpo", "contenido del comentario"], ["tema_id", 1], ["updated_at", Fri, 22 Aug 2014 07:18:57 BOT -04:00]]
UPDATE "tema_comentarios" SET "usuario_id" = ?, "updated_at" = ? WHERE "tema_comentarios"."id" = 1  [["usuario_id", 1], ["updated_at", Fri, 22 Aug 2014 07:18:57 BOT -04:00]]
---
    def create
    	@tema = Tema.find(params[:tema_id])
    	@comentario = @tema.tema_comentarios.create(comentario_params)
    	@comentario.usuario_id = current_user.id
    	@comentario.save