app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @usuario = Usuario.find(params[:id])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "usuarios" SET "contrasenia" = ?, "solicitud_contrasenia_id" = ?, "updated_at" = ? WHERE "usuarios"."id" = 1  [["contrasenia", "770c2371c79b47a1cedafb9f05287eb5"], ["solicitud_contrasenia_id", -1], ["updated_at", Fri, 22 Aug 2014 07:19:11 BOT -04:00]]
---
  def password_recovered
    if(current_user!=nil)
      redirect_to root_url
    else
      @request_id = params[:id_request]
      pass = params[:contrasenia_nueva].to_s
      newPass = params[:contrasenia_nueva2].to_s
      @usuario = Usuario.find(params[:id_user])
      if (pass == newPass)
        if(pass.length > 5)
          @usuario.contrasenia = Digest::MD5.hexdigest(pass)
          @usuario.solicitud_contrasenia_id =- 1
          @usuario.save

SELECT "solicitud_contrasenia".* FROM "solicitud_contrasenia" WHERE "solicitud_contrasenia"."id" = ? LIMIT 1  [["id", "1"]]
---
  def recover
    if(current_user != nil)
       @errorMessagge = "No puede recuperar su contraseña si esta loggeado"
    else
    begin
      password_request = SolicitudContrasenia.find(params[:id_request])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "usuarios" SET "activa" = ?, "updated_at" = ? WHERE "usuarios"."id" = 1  [["activa", true], ["updated_at", Fri, 22 Aug 2014 07:19:12 BOT -04:00]]
---
def confirm
  if(current_user == nil)
    @messagge="Error, datos invalidos"
  begin
    #usuario= Usuario.find(AESCrypt.decrypt(params[:pass].to_s,"Taller"))
    usuario = Usuario.find(params[:pass].to_s)
    rescue ActiveRecord::RecordNotFound
    rescue OpenSSL::Cipher::CipherError
 end
  if(usuario != nil)
    if(!usuario.activa)
    usuario.activa = true
    usuario.save