app/views/layouts/_barra_grupos.html.erb

SELECT "grupos".* FROM "grupos" WHERE "grupos"."estado" = 'f'
---
              <a class="list-group-item list-group-item-info">Publicos</a>
              <% publicos=Grupo.where(:estado => false) %>