app/views/layouts/_navigation.html.erb

        <% mensajes_nuevos.each do |mensaje|%>
            <% usuario = Usuario.find(mensaje.de_usuario_id)%>
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 2]]

                    <tr>
                      <th><a href="/tareas/<%=notificacion.id_item%>" role="button" class="btn" data-toggle="modal"><b><%=usuario.nombre_usuario%></b> ha creado la tarea <%=notificacion.title[0,5]+(notificacion.title.length>5 ? "..." : "")%>
---
SELECT "usuarios".* FROM "usuarios"